# Eleman İşlemleri

In [15]:
import pandas as pd
import numpy as np

In [3]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [16]:
sozluk={"var1": s1, "var2":s2,"var3":s3}

In [17]:
pd=pd.DataFrame(sozluk)

In [18]:
pd

   var1  var2  var3
0     8     6     8
1     9     0     0
2     3     3     0
3     5     3     4
4     6     9     6

In [21]:
pd.index=(1,2,3,4,5)

In [22]:
pd

   var1  var2  var3
1     8     6     8
2     9     0     0
3     3     3     0
4     5     3     4
5     6     9     6

In [24]:
pd[0:3]

   var1  var2  var3
1     8     6     8
2     9     0     0
3     3     3     0

In [25]:
#silme

In [26]:
pd.drop(1)

   var1  var2  var3
2     9     0     0
3     3     3     0
4     5     3     4
5     6     9     6

In [41]:
pd.drop("var2",axis=1,inplace=True)

In [42]:
pd

   var1  var3
3     3     0
5     6     6

In [62]:
import pandas as pd
sozluk2={"Şehirler":["İstanbul","Bursa","Ankara"],"Plakalar":[34,16,6]}
df1=pd.DataFrame(sozluk2)

In [67]:
delList=["i","a"]

In [68]:
df1.drop(delList,axis=0)

  Şehirler  Plakalar
b    Bursa        16

In [79]:
"Bursa" in df1.values

True

In [98]:
a=np.arange(9).reshape((3,3))
df2=pd.DataFrame(a)
df2.columns=["var1","var2","var3"]
df2

   var1  var2  var3
0     0     1     2
1     3     4     5
2     6     7     8

In [102]:
l=["var1","cas","var2"]
for i in l:
    print(i in df2)

True
False
True

In [104]:
df2

   var1  var2  var3
0     0     1     2
1     3     4     5
2     6     7     8

In [109]:
df2[["var1","var3"]]

   var1  var3
0     0     2
1     3     5
2     6     8

In [111]:
df2["var4"]=df2["var1"]*df2["var2"]

In [112]:
df2

   var1  var2  var3  var4
0     0     1     2     0
1     3     4     5    12
2     6     7     8    42

In [117]:
df2["ort"]=df2["var1"].mean()

In [118]:
df2

   var1  var2  var3  var4  ort
0     0     1     2     0  3.0
1     3     4     5    12  3.0
2     6     7     8    42  3.0